# Intro a Pandas

Pandas es una librer칤a de Python que nos permite trabajar con datos tabulares de manera muy eficiente. 

En el mundo del an치lisis de datos, Pandas se ha convertido en una herramienta fundamental para cient칤ficos de datos, analistas y cualquier persona que trabaje con datos en Python. Con Pandas, puedes realizar operaciones como limpieza, manipulaci칩n, visualizaci칩n y an치lisis de datos de manera eficiente.

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1920px-Pandas_logo.svg.png)

## 1. Instalar Pandas

Para instalar Pandas, ejecuta el siguiente comando en tu terminal:

```bash
pip install pandas==<version>
```

In [1]:
import pandas as pd

## 2. Series y Dataframes

Pandas tiene dos estructuras de datos principales: Series y DataFrames.

- **Series**: es un array unidimensional. Es similar a una columna en una tabla de Excel.
- **DataFrame**: es una estructura de datos bidimensional con filas y columnas con etiquetas. Es similar a una tabla de Excel.

### 2.1 Series

Para crear una Serie, puedes pasar una lista de elementos y Pandas crear치 una Serie con 칤ndices num칠ricos.

In [5]:
serie = pd.Series([1, 2, 3, 4, 5])
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

### 2.2 DataFrames

Para crear un DataFrame, puedes pasar un diccionario de listas, donde cada clave es el nombre de la columna y cada valor es una lista de elementos.

In [4]:
data = {
    'name': ['Mar칤a', 'Daniel', 'Marisa', 'David', 'Sabrina'],
    'age': [16, 7, 29, None, 33], 
    'city': ['Madrid', 'Madrid', 'M치laga', 'M치laga', 'Valladolid'],
    'height': [None, 1.20, 1.60, 2.01, 1.83]
}

df = pd.DataFrame(data)
df

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Aunque lo m치s normal es crear DataFrames a partir de archivos CSV, Excel, bases de datos, etc. En este caso, vamos a guardar el DataFrame en un archivo CSV y posteriormente lo leeremos.

In [6]:
CSV_PATH = 'data.csv'

df.to_csv(CSV_PATH, index=False)
df = pd.read_csv(CSV_PATH)
df

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

## 3. Basics de un Dataframe

Podemos visualizar los primeros/칰ltimos registros de un DataFrame con los m칠todos `head()` y `tail()`, respectivamente.

In [7]:
df.head(2)

     name   age    city  height
0   Mar칤a  16.0  Madrid     NaN
1  Daniel   7.0  Madrid     1.2

In [8]:
df.tail(2)

      name   age        city  height
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Los dataframes tienen una serie de atributos b치sicos: `.columns`, `.values`, `.shape`, `.dtypes`, etc. Algunos de ellos te recordar치n a los atributos de un array de NumPy.

In [9]:
df.columns

Index(['name', 'age', 'city', 'height'], dtype='object')

In [10]:
df.values

array([['Mar칤a', 16.0, 'Madrid', nan],
       ['Daniel', 7.0, 'Madrid', 1.2],
       ['Marisa', 29.0, 'M치laga', 1.6],
       ['David', nan, 'M치laga', 2.01],
       ['Sabrina', 33.0, 'Valladolid', 1.83]], dtype=object)

In [9]:
df.shape

(5, 4)

In [10]:
df.dtypes

name       object
age       float64
city       object
height    float64
dtype: object

## 4. Estad칤sticas b치sicas

Pandas nos permite obtener la informaci칩n general de un Dataframe con el m칠todo `info()`.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    5 non-null      object
 3   height  4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes



Pandas nos permite obtener estad칤sticas b치sicas de un DataFrame con el m칠todo `describe()`. Este m칠todo nos devuelve un resumen de las estad칤sticas descriptivas de las **columnas num칠ricas**.

In [12]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.250000  1.660000
std    11.954776  0.349571
min     7.000000  1.200000
25%    13.750000  1.500000
50%    22.500000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

## 5. Indexaci칩n

Recordemos que el indexing consiste en seleccionar un subconjunto de datos de un DataFrame. Recordemos antes c칩mo era el dataframe original y veamos que Pandas nos permite indexar un DataFrame de diferentes maneras.

In [13]:
df

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83


**Por nombre de columna**: `df['column_name']`

In [14]:
df['name']

0      Mar칤a
1     Daniel
2     Marisa
3      David
4    Sabrina
Name: name, dtype: object

**Por posici칩n (칤ndice) de la fila**: `df.iloc[0]`

In [15]:
df.iloc[0]

name       Mar칤a
age         16.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de la fila**: `df.loc['row_label']`

In [16]:
df.loc[0]  # en este caso, como los indices son los mismos que las posiciones, `loc` es lo mismo que `iloc`

name       Mar칤a
age         16.0
city      Madrid
height       NaN
Name: 0, dtype: object

**Por etiqueta de fila y columna**: `df.loc['row_label', 'column_name']`

In [17]:
df.loc[0, 'name']

'Mar칤a'

**Por condici칩n**: `df[df['column_name'] > 0]`

In [18]:
condition = df['age'] > 18
df[condition]  # as칤 se filtran los datos

      name   age        city  height
2   Marisa  29.0      M치laga    1.60
4  Sabrina  33.0  Valladolid    1.83

**Por valores m칤nimos y m치ximos**: `df['column_name'].idxmin()` y `df['column_name'].idxmax()`

In [19]:
max_age_row_idx = df["age"].idxmax()
max_age_row = df.loc[max_age_row_idx]
max_age_row

name         Sabrina
age             33.0
city      Valladolid
height          1.83
Name: 4, dtype: object

## 6. Data Cleaning

El data cleaning es un paso fundamental en cualquier an치lisis de datos. Pandas nos permite realizar operaciones de limpieza de datos de manera muy eficiente. **Es muy com칰n encontrarnos con valores nulos** en nuestros datasets. Pandas nos ofrece m칠todos para tratar estos valores nulos, como `dropna()`, `fillna()` y `isnull()`. Recordemos primero, el dataset original.

In [20]:
df

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Por ejemplo, para ver si hay valores nulos en un DataFrame, podemos usar los metodos `isnull()` 칩 `isna()`.

In [21]:
df.isnull()

    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Para **eliminar** las filas con valores nulos, podemos usar el m칠todo `dropna()`.

In [22]:
df.dropna()

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
4  Sabrina  33.0  Valladolid    1.83

Para **rellenar** los valores nulos con un valor espec칤fico, podemos usar el m칠todo `fillna()`.

In [23]:
df.fillna(0)  # rellena los valores nulos con 0

      name   age        city  height
0    Mar칤a  16.0      Madrid    0.00
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   0.0      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Estos m칠todos son aplicables tambi칠n a las Series (columnas de un DataFrame).

In [24]:
df['age'].fillna(10)

0    16.0
1     7.0
2    29.0
3    10.0
4    33.0
Name: age, dtype: float64

# Ejercicios

Toma el dataframe original y gu치rdalo como un CSV

In [11]:
CSV_PATH = 'dataEjercicio.csv'

df.to_csv(CSV_PATH, index=False)
df = pd.read_csv(CSV_PATH)
df

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Ahora lee el archivo CSV

In [14]:
dataFrame=pd.read_csv('dataEjercicio.csv')
dataFrame

      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Muestra los 3 primeros registros del DataFrame.

In [15]:
df.head(3)

     name   age    city  height
0   Mar칤a  16.0  Madrid     NaN
1  Daniel   7.0  Madrid     1.2
2  Marisa  29.0  M치laga     1.6

Muestra los 4 칰ltimos registros del DataFrame.

In [16]:
df.tail(4)

      name   age        city  height
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Dime cuantos datos tiene el DataFrame (游눠 es lo mismo que calcular el n칰mero de filas). 쯘n `numpy` vimos 2 formas de calcular este dato, recuerdas?

In [26]:
columnas = df.columns
#4 columnas
registro = df.shape 

print("registros:", registro)
print("columnas:", columnas)

registros: (5, 4)
columnas: Index(['name', 'age', 'city', 'height'], dtype='object')

#Mu칠strame las estad칤sticas b치sicas del DataFrame.

In [30]:
df.describe()

             age    height
count   4.000000  4.000000
mean   21.250000  1.660000
std    11.954776  0.349571
min     7.000000  1.200000
25%    13.750000  1.500000
50%    22.500000  1.715000
75%    30.000000  1.875000
max    33.000000  2.010000

Obt칠n los datos de la columna 'name' 쮺ual es el tipo de dato de esta columna?

In [39]:
dataFrame=pd.read_csv('dataEjercicio.csv')
# Verificar las columnas del DataFrame
print("Columnas del DataFrame:", df.columns)

# Nombre de la columna
name = 'name'  #me cago en la puta acuerdate de renombrarlo que despues no funciona
try:
    tipo_dato = df[name].dtype
    print(f"El tipo de dato de la columna '{name}' es {tipo_dato}")
except KeyError:
    print(f"La columna '{name}' no existe en el DataFrame")

Columnas del DataFrame: Index(['name', 'age', 'city', 'height'], dtype='object')
El tipo de dato de la columna 'name' es object

游꺘勇 Recuera que una Serie se puede tratar como un array de numpy, por tanto, obt칠n los datos de la columna "age" y calcula la media. 쮺oincide con el resultado que arroja pandas en la celda superior? (游눠 en `numpy` la media se calcula usando `np.mean`)

In [42]:
dataFrame = pd.read_csv('dataEjercicio.csv')

# cols del dataframe
print("Columnas del DataFrame:", dataFrame.columns)

# Calcular la media
if 'age' in dataFrame.columns:
    edad_media = dataFrame['age'].mean()
    print(f"La edad media es {edad_media}")
else:
    print("La columna 'age' no existe en el DataFrame")

Columnas del DataFrame: Index(['name', 'age', 'city', 'height'], dtype='object')
La edad media es 21.25

Ahora calcula la edad m치xima y m칤nima de la columna "age".

In [45]:
max_age_row_idx = df["age"].idxmax()
max_age_row = df.loc[max_age_row_idx]
print("edad maxima",max_age_row)

min_age_row_idx = df["age"].idxmin()
min_age_row = df.loc[min_age_row_idx]
print("edad minima",min_age_row)

edad maxima name         Sabrina
age             33.0
city      Valladolid
height          1.83
Name: 4, dtype: object
edad minima name      Daniel
age          7.0
city      Madrid
height       1.2
Name: 1, dtype: object

游꺘勇 Una vez obtenida la edad m칤nima, 쮺ual es el nombre de dicha persona?

In [46]:
Daniel = df.loc[df['name'] == 'Daniel']

Filtra el DataFrame: muestra las filas donde la edad sea mayor a 25.

In [47]:
condition = df['age'] > 25
print(df[condition] )

      name   age        city  height
2   Marisa  29.0      M치laga    1.60
4  Sabrina  33.0  Valladolid    1.83

Filtra el DataFrame: muestra las filas donde la gente sea de 'M치laga'. (游눠 utiliza el operador `==`)

In [48]:
condition2 = df['city'] == 'M치laga'
print(df[condition2] )

     name   age    city  height
2  Marisa  29.0  M치laga    1.60
3   David   NaN  M치laga    2.01

In [ ]:
dataFrame=pd.read_csv('dataEjercicio.csv')
# Verificar las columnas del DataFrame
print("Columnas del DataFrame:", df.columns)

# Nombre de la columna
name = 'name'  #me cago en la puta acuerdate de renombrarlo que despues no funciona
try:
    tipo_dato = df[name].dtype
    print(f"El tipo de dato de la columna '{name}' es {tipo_dato}")
except KeyError:
    print(f"La columna '{name}' no existe en el DataFrame")

Columnas del DataFrame: Index(['name', 'age', 'city', 'height'], dtype='object')
El tipo de dato de la columna 'name' es object

游꺘勇 Filtra el Dataframe: filas donde la gente sea de 'M치laga' y mayor de 25. (游눠 para sumar dos condiciones se utiliza el operador `and` que se representa en python con `&`, i.e.: 

```python
compose_condition = condition1 & condition2
```

In [49]:
condition = df['age'] > 25
condition2 = df['city'] == 'M치laga'
compose_conditional = condition & condition2
print(df[compose_conditional] )

     name   age    city  height
2  Marisa  29.0  M치laga     1.6

Obt칠n la m치scara de los valores que son nulos en el DataFrame.

In [51]:
df = pd.DataFrame(data)

# Guardar el DataFrame en un archivo CSV
df.to_csv(CSV_PATH, index=False)

# Leer el archivo CSV para crear un DataFrame
df = pd.read_csv(CSV_PATH)

# Obtener la m치scara de valores nulos
mascara_nulos = df.isnull()

# Mostrar el DataFrame original y la m치scara de valores nulos
print("DataFrame original:")
print(df)
print("\nM치scara de valores nulos:")
print(mascara_nulos)

DataFrame original:
      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

M치scara de valores nulos:
    name    age   city  height
0  False  False  False    True
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False  False   False

Ahora obt칠n la m치scara de los valores que NO son nulos en el DataFrame. (游눠 busca en la documentaci칩n de pandas, o en google, c칩mo hacerlo)

In [53]:
df = pd.DataFrame(data)

# Guardar el DataFrame en un archivo CSV
df.to_csv(CSV_PATH, index=False)

# Leer el archivo CSV para crear un DataFrame
df = pd.read_csv(CSV_PATH)

# Obtener la m치scara de valores nulos
mascara_nulos = df.notnull()

# Mostrar el DataFrame original y la m치scara de valores nulos
print("DataFrame original:")
print(df)
print("\nM치scara de valores nulos:")
print(mascara_nulos)

DataFrame original:
      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

M치scara de valores nulos:
   name    age  city  height
0  True   True  True   False
1  True   True  True    True
2  True   True  True    True
3  True  False  True    True
4  True   True  True    True

Elimina los valores nulos del DataFrame.

In [54]:
df = pd.DataFrame(data)

# Mostrar el DataFrame original
print("DataFrame original:")
print(df)


# Rellenar valores nulos con un valor espec칤fico (por ejemplo, 0)
df_relleno = df.fillna("")
print("\nDataFrame con valores nulos rellenados con Nada:")
print(df_relleno)

DataFrame original:
      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

DataFrame con valores nulos rellenados con Nada:
      name   age        city height
0    Mar칤a  16.0      Madrid
1   Daniel   7.0      Madrid    1.2
2   Marisa  29.0      M치laga    1.6
3    David            M치laga   2.01
4  Sabrina  33.0  Valladolid   1.83

Rellena todos los valores nulos con 1.

In [55]:
df = pd.DataFrame(data)

# Mostrar el DataFrame original
print("DataFrame original:")
print(df)


# Rellenar valores nulos con un valor espec칤fico (por ejemplo, 0)
df_relleno = df.fillna(1)
print("\nDataFrame con valores nulos rellenados con Nada:")
print(df_relleno)

DataFrame original:
      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

DataFrame con valores nulos rellenados con Nada:
      name   age        city  height
0    Mar칤a  16.0      Madrid    1.00
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   1.0      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

Columnas del DataFrame: Index(['name', 'age', 'city', 'height'], dtype='object')
El tipo de dato de la columna 'name' es object

Ahora rellena s칩lo los valores nulos de la columna 'age' con 10.

In [ ]:
df = pd.DataFrame(data)

# Mostrar el DataFrame original
print("DataFrame original:")
print(df)


# Rellenar valores nulos con un valor espec칤fico (por ejemplo, 0)
df_relleno = df.fillna(10)
print("\nDataFrame con valores nulos rellenados con Nada:")
print(df_relleno)

游꺘勇 Ahora rellena los valores nulos de la columna 'height' con la media de dicha columna

In [60]:
df = pd.DataFrame(data)

# Especificar las columnas que quieres rellenar
columnas_a_rellenar = ['height']

# Crear una copia del DataFrame original para no modificarlo directamente
df_relleno = df.copy()

# Mostrar el DataFrame original
print("DataFrame original:")
print(df)

# Rellenar valores nulos solo en las columnas espec칤ficas con el valor medio
for columna in columnas_a_rellenar:
    if df_relleno[columna].dtype in ['float64', 'int64']:
        mean_value = df_relleno[columna].mean()
        df_relleno[columna].fillna(mean_value, inplace=True)
    else:
        print(f"La columna {columna} no tiene un tipo de dato num칠rico.")

# Mostrar el DataFrame con valores nulos rellenados en las columnas especificadas
print("\nDataFrame con valores nulos en la columna 'height' rellenados con el valor medio:")
print(df_relleno)

DataFrame original:
      name   age        city  height
0    Mar칤a  16.0      Madrid     NaN
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

DataFrame con valores nulos en la columna 'height' rellenados con el valor medio:
      name   age        city  height
0    Mar칤a  16.0      Madrid    1.66
1   Daniel   7.0      Madrid    1.20
2   Marisa  29.0      M치laga    1.60
3    David   NaN      M치laga    2.01
4  Sabrina  33.0  Valladolid    1.83

/tmp/ipykernel_20075/433270345.py:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_relleno[columna].fillna(mean_value, inplace=True)

## BONUS: Explora los datos del dataset de Titanic

El dataset de Titanic es un dataset muy famoso en el mundo del an치lisis de datos. Contiene informaci칩n sobre los pasajeros del Titanic, incluyendo si sobrevivieron o no, su edad, sexo, clase, etc.

In [25]:
CSV_PATH = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"

df = pd.read_csv(CSV_PATH)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Hazte preguntas como, 쯈u칠 porcentaje de pasajeros sobrevivi칩? 쮺u치l es la edad media de los pasajeros? 쮺u치ntos pasajeros hab칤a en cada clase? 쮺u치l es la edad media de los pasajeros que sobrevivieron y de los que no? 쮺u치l es la edad m치xima de los pasajeros que sobrevivieron y de los que no?